In [2]:
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
     "temprature":[32,45,30],
    "huidity":[20,30,40]

})
india_weather

       city  temprature  huidity
0    mumbai          32       20
1     delhi          45       30
2  banglore          30       40

In [3]:
us_weather=pd.DataFrame({
    "city":["mumi","dei","bange"],
     "temprature":[62,25,30],
    "huidity":[90,40,50]

})

In [5]:
pd.concat([india_weather,us_weather],ignore_index=True)

       city  temprature  huidity
0    mumbai          32       20
1     delhi          45       30
2  banglore          30       40
3      mumi          62       90
4       dei          25       40
5     bange          30       50

In [6]:
import pandas as pd
df1=pd.DataFrame({
    "city":["newyork","chicago","ocland"],
    "humidity":[65,54,23]
})
df1

      city  humidity
0  newyork        65
1  chicago        54
2   ocland        23

In [11]:
df2=pd.DataFrame({
    "city":["newyork","chic","ocla"],
    "humidity":[6,4,3]
})
df2

      city  humidity
0  newyork         6
1     chic         4
2     ocla         3

In [12]:
df3=pd.merge(df1,df2,on="city")
df3

      city  humidity_x  humidity_y
0  newyork          65           6